"""
甲想好了一个 n 位数字让乙来猜，只要猜的数字位数正确，至多有 1 位与谜底不同，
且不同的数字相差不超过 1，就算猜对了。例如谜底是 67，若乙猜 66、68、77、57，就都算对了；猜 167 就不能算对。
输入格式：
输入首先在第一行给出一个不超过 1000 位数的、最高位不是 0 的正整数，
是甲给出的谜底。随后若干行，每行给出一个乙猜的数字，都是最高位不是 0 的正整数。直到出现 -1 表示输入结束，
这个数字不要做任何处理。题目保证乙至少猜了一次
"""
def main():
    s = input()
    while True:
        t = input()
        if t == '-1':
            break
        if len(s) == len(t) and sum([abs(int(s[i]) - int(t[i])) for i in range(len(s))]) <= 1:
            print('YES')
        else:
            print('NO')

main()